In [30]:
# import library
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [31]:
dataset=pd.read_csv("Social_Network_Ads.csv")

In [32]:
dataset

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [33]:
dataset=pd.get_dummies(dataset,drop_first=True)

In [34]:
dataset

      User ID  Age  EstimatedSalary  Purchased  Gender_Male
0    15624510   19            19000          0         True
1    15810944   35            20000          0         True
2    15668575   26            43000          0        False
3    15603246   27            57000          0        False
4    15804002   19            76000          0         True
..        ...  ...              ...        ...          ...
395  15691863   46            41000          1        False
396  15706071   51            23000          1         True
397  15654296   50            20000          1        False
398  15755018   36            33000          0         True
399  15594041   49            36000          1        False

[400 rows x 5 columns]

In [35]:
dataset=dataset.drop("User ID",axis=1)

In [36]:
dataset

     Age  EstimatedSalary  Purchased  Gender_Male
0     19            19000          0         True
1     35            20000          0         True
2     26            43000          0        False
3     27            57000          0        False
4     19            76000          0         True
..   ...              ...        ...          ...
395   46            41000          1        False
396   51            23000          1         True
397   50            20000          1        False
398   36            33000          0         True
399   49            36000          1        False

[400 rows x 4 columns]

In [37]:
dataset["Purchased"].value_counts()

Purchased
0    257
1    143
Name: count, dtype: int64

In [38]:
independent=dataset[['Age','EstimatedSalary','Gender_Male']]

In [39]:
dependent=dataset[["Purchased"]]

In [40]:
independent.shape

(400, 3)

In [41]:
dependent

     Purchased
0            0
1            0
2            0
3            0
4            0
..         ...
395          1
396          1
397          1
398          0
399          1

[400 rows x 1 columns]

In [42]:
#Training and Test Data Split
from sklearn.model_selection import train_test_split
X_test,X_train,y_test,y_train=train_test_split(independent,dependent,test_size=1/3,random_state=0)

In [43]:
from sklearn.svm import SVC
classifier=SVC(kernel='rbf',random_state=0)
classifier=classifier.fit(X_train,y_train)

C:\Users\rampr\anaconda3\Lib\site-packages\sklearn\utils\validation.py:1408: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [44]:
y_pred=classifier.predict(X_test)

In [45]:
from sklearn.metrics import confusion_matrix
cm=confusion_matrix(y_test,y_pred)

In [46]:
from sklearn.metrics import classification_report
clf_report=classification_report(y_test,y_pred)

In [47]:
print(clf_report)

              precision    recall  f1-score   support

           0       0.73      0.95      0.83       172
           1       0.81      0.36      0.50        94

    accuracy                           0.74       266
   macro avg       0.77      0.66      0.66       266
weighted avg       0.76      0.74      0.71       266

In [54]:
print(cm)

[[164   8]
 [ 60  34]]

In [58]:
classifier.predict([[46,41000,0]])

C:\Users\rampr\anaconda3\Lib\site-packages\sklearn\utils\validation.py:2739: UserWarning: X does not have valid feature names, but SVC was fitted with feature names
  warnings.warn(

array([0])